{
  "menu": {
    "Home" : "Resume",
    "Certificates" : "Certificates",
    "Jobs" : "Jobs",
    "Infos" : "Infos",
    "Config" : "Config",
    "Back" : "( Back )"
  },
  "404": {
    "title" : "Nothing to see here!",
    "buttonTitle" : "Go to the resume page"
  },
  "home": {
    "header": {
      "Name" : "Caio Pachêco Barilli",
      "JobTitle" : "FULLSTACK DEVELOPER",
      "Location" : "São Paulo - SP",
      "Email" : "caiobarilli@gmail.com",
      "Phone" : "+55 11 98624-3016",
      "Experience" : "11 years of experience",
      "Status" : "Available for new opportunities"
    },
    "about": {
      "short_description" : "I am a professional with experience in the area, graduated in Internet Systems from Centro Universitário SENAC, capable of developing projects as a team and easily adapting to changes.",
      "read_more" : "( see more )"
    },
    "experiences": {
      "title" : "Summary of experiences",
      "read_more" : "( see more )"
    }
  },
  "infos": {
    "title": "Infos"
  },
  "certificates": {
    "title": "Certificates"
  },
  "about": {
    "title" : "About",
    "complete_description" : "<div><p>Technologist in Internet Systems with ten years of experience in the field,<br>I have expertise as a Fullstack Developer. I have a comprehensive knowledge<br>of open-source languages and technologies, such as PHP, JavaScript, and more.<br><br><p>🎓 Getting ready to start a postgraduate degree in Software Architecture.<br><br><p>📖 Studying extensively TypeScript and frameworks like Next.js, Expo, and Nest.js.<br><br><p>🧑‍💼 Currently seeking new job opportunities.<br><br></div><div><h2>Educational Background</h2><h3>Jul. 2012 - Dec. 2015</h3><p>In 2012, I began my studies in Internet Systems at the Senac University Center. Throughout all the semesters, I completed an integrative project, totaling five projects:<br>A Landing Page, an e-commerce website, a PHP API, an Android App, and a Dashboard.<br>The first semester was where I learned to program using algorithmic language and had my first introduction to HTML5, CSS, and JavaScript. In the second semester, I learned C# and Java with Object-Oriented Programming, as well as how to create an e-commerce website using the .NET framework. In the third semester, I learned PHP and was introduced to information security. In the fourth semester, I delved deeper into Java, creating Servlets, and also learned to create Android Apps using the Eclipse IDE. The final semester was where I worked with the Laravel framework and also created a Dashboard using the Angular framework.</div>"
  },
  "jobs": {
    "title" : "Jobs",
    "complete_description" : "<div><div><h2>Professional experience</h2><div><h3>Feb. 2013 - Jul. 2013</h3><p>In 2013, I started my career as an intern / junior programmer at VAD - Estúdio Multimedia in São Paulo, Brazil. In this role, I worked with technologies such as:<br>JQuery, HTML, CSS and JavaScript.<br><br>- I worked on the development of websites and web systems, using technologies mentioned above.<br>- Also performed maintenance on existing websites and systems.<br>- Performed the development of e-mail marketing pieces.<br>- Carry out e-mail marketing surveys using the PhpMailer tool.</p></div><div><h3>Feb 2016 - Oct 2017</h3><p>Between February 2016, I had already graduated as a Technologist in Internet Systems and worked at Capital Mídia in São Paulo, Brazil. In the position of Programmer, after the trial period, I was hired and after a year I was promoted to Full Programmer. During this period, I worked with technologies such as JQuery, Git, PHP, HTML5, WordPress, CSS and JavaScript.<br><br>- Conducted meetings with the creation team to align projects.<br>- Estimated the development time of the project together with the creation team.<br>- Held meetings with the external development team for project delivery.<br>- I worked on hiring new developers.<br>- I worked as a leader technician of the development team, assisting the developers below and distributing work.<br>- I worked on the development of websites and web systems, using the technologies mentioned above.<br>- I worked on the development of landing pages and hotsites.<br>- I also carried out maintenance of existing websites and systems.<br>- Carried out the development of email marketing pieces.</p></div><div><h3>Oct 2017 - Feb 2018</h3><p>At the end of 2017 I started working from home as a freelancer, where I worked as a Developer Frontend in partnership with Agencia WebSide. During this period, I carried out several projects for the agency, where I was responsible for the frontend development of projects.<br>and worked with technologies such as JQuery, Git, HTML5, CSS.<br><br>- Held meetings with the development team for project alignment.<br>- I worked on the development of the frontend of websites and landing pages, using the technologies mentioned above.<br>- I worked on the development of email marketing pieces.</p></div><div><h3>Feb 2018 - Oct 2018</h3><p>From February 2018 to October 2018, I was a Front-end Developer at 123Carros, São Paulo, Brazil. During this period, I was responsible for the frontend development of the Marketplace.<br>I worked with technologies such as JQuery, Git, Laravel, SASS and PHP.<br><br>- Realized meetings with the development team to align projects.<br>- I worked on development of the platform's frontend.<br>- I worked as technical leader of the frontend development team, helping the developers below and distributing work.<br>- I worked on the development of the frontend of the platform using the technologies mentioned above.<br>- I worked on the development of a blog for the platform using WordPress.</p></div><div><h3>Nov 2017 - Sep 2018</h3><p>As of November 2017, I returned to working from home as a freelancer, where I worked as Frontend developer in partnership with Agencia WebSide. where he was responsible for the development frontend of projects. I continued working with technologies such as JQuery, Git, HTML5, CSS.<br><br>- Held meetings with the development team to align projects.<br>- Estimated time project development together with the development team.<br>- I worked on the development of the frontend of websites and landing pages, using the technologies mentioned above.<br>- I worked on development of email marketing pieces.</p></div><div><h3>Sep 2018 - Dec 2018</h3><p>In September 2018 and until December 2018, I worked as a Fullstack Developer at Agência Shape Web, Campo Grande, Mato Grosso do Sul, Brazil. I worked with MySQL, JQuery, Javascript, Git, SASS, PHP and HTML5.<br><br>- I passed a practical test for fullstack php developer.<br>- I performed meetings with the development team to align projects.<br>- Estimated the development time development of projects together with the development team.<br>- I worked on development full stack of websites and landing pages and also an ecommerce platform, using technologies mentioned above.</p></div><div><h3>Feb 2019 - March 2018</h3><p>In 2019, I returned to live in São Paulo, and worked as a Fullstack Developer at Agência 3xceler, São Paulo, Brazil, where I worked with Stylus, MySQL, JQuery, Git, PHP, HTML5 and WordPress.<br><br>- I passed a practical test for fullstack php developer.<br>- I held meetings with the development team for project alignment.<br>- I worked on the fullstack development of two complete website sites using cms wordpress.</p></div><div><h3>Mar 2019 - Apr 2020</h3><p>Between March 2019 and April 2020, I worked as a Front-end Developer at Zebra Deluxe Communication, São Paulo, Brazil. During this period, I worked with MySQL, JQuery, Laravel, SASS, WordPress and JavaScript.<br><br>- I passed a practical test for fullstack developer full.<br>- Performed Daily Scrum with the development team to align projects.<br>- Estimated project development time together with the development team.<br>- I worked at hiring new developers.<br>- Acted as technical leader of the development team frontend, helping the developers below and distributing work.<br>- I worked on the development of websites and web systems, using the technologies mentioned above.<br>- I worked in development of landing pages and hotsites.<br>- Also carried out maintenance of websites and systems existing ones.<br>- Carried out the development of email marketing pieces.</p></div><div><h3>Mar 2020 - Dec 2020</h3><p>In March 2020, I started my work at Interaktiv, where I worked as a Fullstack Developer.<br>In June of the same year, Interaktiv underwent a merger and acquisition by the Brazilian multinational CTC. I worked with technologies such as Linux, Docker, Git, CakePHP, Laravel, WordPress, Vue.js and JavaScript.<br><br>- I passed a practical test for a full stack developer.<br>- Performed Daily Scrum with the development team to align projects.<br>- Performed Scrum planning with the development team to align projects once a month.<br>- I handled Tickets created by customers.<br>- I registered all hours spent (on tickets or internal demands) carried out on the interaktiv platform.<br>- I worked on development of websites and web systems, using the technologies mentioned above.<br>- Also carried out maintenance on existing websites and systems.<br></p></div><div><h3>Jan 2021 - Feb 2021</h3><p>In January 2022, after a recommendation, I started freelance work for the client Ferraz and Fonseca Dentistry. Where I worked on the entire construction of the company's institutional website using the CMS Wordpress.<br><br>- Held meetings with the client to align projects.<br>- Worked on development of the frontend and backend of the website using cms wordpress.<br>- I worked on development of banners and page layout using photoshop.<br>- I carried out the versioning of the site using git and github.<br>- I deployed the site using cpanel.<br></p></div><div><h3>Mar 2021 - Jun 2021</h3><p>In March 2022, after another recommendation, I started freelance work for CBC Agronegócios. During this period I worked on several adjustments to the company's institutional website with the CMS Wordpress.<br><br>- Held meetings with the client to align projects.<br>- Worked on development of the website's frontend and backend of some parts of the website<br>- I worked on improving performance and optimization of the project<br>- Developed new pages and maintained pages old<br>- I configured the site's SEO plugin and SSL certificate<br>- I carried out several updates to the site's legacy theme</p></div><div><h3>Aug 2021 - Nov 2021</h3><p>In August 2022, after another recommendation, I started a new freelance job for the Agency LayerUp. During this period I worked on two company projects with CMS Wordpress.<br><br>- Held meetings with the client to align projects.<br>- Used Git to project versioning.<br>- I worked on the development of the frontend and complete backend of a landing page. (geradev)<br>- I worked on the development of the frontend and complete backend of a blog. (playcenter)<br>- I worked on deploying projects using cpanel.<br></p></div><div><h3>Feb 2022 - Mar 2022</h3><p>I started 2022 working at Meeta Solutions, where I was hired as a PJ in a hybrid model in the role of Fullstack Developer. During this period I was allocated to a project at FIS Global residing at FIS headquarters in Jundíai, São Paulo. During my trial period I used technologies such as Windows, Docker, JQuery, Laravel, Blade Templates, CSS and Git.<br><br>- I was approved in a practical test for a full stack developer.<br>- I carried out part of the training PR, via video call, with the PM of the project who was allocated<br>- Carried out specific demands for development of websites and web systems.<br>- Registered all tasks carried out in the runrun.it platform.<br></p></div><div><h3>Mar 2022 - Apr 2022</h3><p>I made the decision in March to change jobs and started looking for new opportunities, I was hired as a PJ in a home office model in the role of Frontend Developer at QuikDev with the headquarters located in Campinas, São Paulo. During this period I worked with technologies such as Typescript, Nextjs, React, TailwindCSS, Git and Docker.<br><br>- I passed a practical developer test full frontend.<br>- I carried out Scrum Planning with the development team to align the project<br>- Performed Daily Scrum with the development team to align projects.<br>- Developed pages with react using NextJS as a frontend framework.<br></p></div><div><h3>May 2022 - Jun 2022</h3><p>In May 2022, I hired new freelancers for Agencia LayerUp. acting directly on the website company, and in another project, which was for an agency client, BRSPICE. During this period I worked with technologies such as Php, Wordpress, SCSS, WEBPACK, Jquery and Javascript.<br><br>- Held meetings with the client to align projects.<br>- Used Git to project versioning.<br>- Worked on Webpack integration and SEO optimization - Worked on reformulation of the frontend to improve code and performance.<br>- Worked on new features (frontend &amp; backend).<br></p></div><div><h3>Jul 2022 - Aug 2022</h3><p>In July 2022, Agencia Zebra Deluxe called me for a new project. carried out the development of an institutional website for an agency client, the project was created with wordpress and the frontend used webpack with javascript and sass.<br><br>- Held meetings with the client for alignment of projects.<br>- Used Git to version the project.<br>- Worked on the development of the frontend and backend of the website using cms wordpress.<br>- I deployed the website using cpanel.<br>- I configured the website's SEO plugin and SSL certificate<br></p></div><div><h3>Sep 2022 - Dec 2023</h3><p>In July 2022, Agencia Zebra Deluxe called me for a new project.<br>I carried out the development of an institutional website for the agency in wordpress.<br>in addition, I also maintained a blog from an agency client. (skincare club)<br><br>- Held meetings with the client to project alignment.<br>- Used Git for project versioning.<br>- Worked on development of the frontend and backend of the website using cms wordpress.<br>- I deployed the website using cpanel.<br>- I configured the website's SEO plugin and certified SSL<br></p></div><div><h3>Dec 2022 - Mar 2023</h3><p>In December 2022, CBC Agronegócios called me for a new project.<br>I carried out the development of a new institutional website for the company in wordpress.<br>the company was going through a brand reformulation and the website would change the domain.<br><br>- Held meetings with the client to project alignment.<br>- Used Git for project versioning.<br>- Worked on development of the frontend and backend of the website using cms wordpress.<br>- I deployed the website using cpanel.<br>- I configured the website's SEO plugin and certified SSL<br></p></div><div><h3>Jun 2023 - Jul 2023</h3><p>In June 2023, Agencia LayerUp called me for a new project.<br>I developed a new institutional website for a company client. (atlaseletro)<br><br>- Held meetings with the client for project alignment.<br>- Used Git to version the project.<br>- Acted in the development of the frontend and backend of the website using cms wordpress.<br>- I carried out the configuration and implementation of Webpack on the website's frontend.<br></p></div><div><h3>Aug 2023 - Sep 2023</h3><p>In August 2023, Agencia Zebra Deluxe called me for a new project.<br>I carried out the development of a new institutional website for a company client. (mobu.business)<br><br>- Held meetings with the client to align projects.<br>- Used Git to versioning of the project.<br>- I worked on the development of the frontend and backend of the website using cms wordpress.<br>- I configured and implemented Webpack on the website's frontend.<br>- I deployed the website using cpanel.<br>- I configured the website's SEO plugin and SSL certificate<br></p></div><div><h3>Oct 2023 - Dec 2023</h3><p>From October 2023 to December 2023, I went back to studying and specializing in technologies such as Node and Typescript. During this period, I studied Node using the Express framework and Typescript using the NestJS and Angular framework. All projects were published on my github and made available to the community.</p></div><div><h3>Jan 2024 - Apr 2024</h3><p>In January 2024, I was hired as a PJ in an in-person model as a Fullstack Developer at KeepCloud with headquarters located in São Paulo, Brazil. During this period I worked with technologies such as Php, Laravel, Git, Docker, Redis, Bootstrap and MySQL.<br><br>- I passed a practical test for a full stack developer.<br>- Performed Daily Scrum with the development team to align projects.<br>- Performed Scrum Planning with the development team to align projects once a month.<br>- I worked on the fullstack development of the platform, using the technologies mentioned above.<br>- I worked on the integration with the API of several cloud servers with the platform.<br>- I worked on the integration with the platform's services API.<br>- I worked on the integration of services installed directly on cloud servers.</p></div></div></div>"
  }
}
