{
  "menu": {
    "Home" : "Resumo",
    "Certificates" : "Certificados",
    "Jobs" : "Trabalhos",
    "Infos" : "Informações",
    "Config" : "Configurações",
    "Back" : "( Voltar )"
  },
  "404": {
    "title" : "Ops.. nada aqui.",
    "buttonTitle" : "Voltar para o resumo"
  },
  "home": {
    "header": {
      "Name" : "Caio Pachêco Barilli",
      "JobTitle" : "DESENVOLVEDOR FULLSTACK",
      "Location" : "São Paulo - SP",
      "Email" : "caiobarilli@gmail.com",
      "Phone" : "+55 11 98624-3016",
      "Experience" : "8 Anos de experiência profissional",
      "Status" : "Buscando uma nova oportunidade"
    },
    "about": {
      "short_description" : "Sou um profissional com experiência na área, formado em Sistemas para Internet pelo Centro Universitário SENAC, capaz de desenvolver projetos em equipe e com facilidade de adequação a mudanças.",
      "read_more" : "( ver completo )"
    },
    "experiences": {
      "title" : "Resumo de experiências",
      "read_more" : "( ver completo )"
    }
  },
  "infos": {
    "title": "Sobre"
  },
  "certificates": {
    "title": "Certificados"
  },
  "about": {
    "title" : "Sobre",
    "complete_description" : "<div><p>Tecnólogo em Sistemas para Internet com dez anos de experiência na área,<br>possuo expertise como Desenvolvedor Fullstack. Tenho um conhecimento abrangente<br>de linguagens e tecnologias de código aberto, como PHP, Javascript e muito mais.<br><br><p>🎓 Me preparando para iniciar uma pós-graduação em Arquitetura de Software.<br><br><p>📖 Estudando amplamente Typescript e frameworks como Nextjs, Expo e NestJs.<br><br><p>🧑‍💼 Atualmente buscando novas oportunidades de trabalho.<br><br></div><div><h2>Formação</h2><h3>jul. de 2012 - dez. de 2015</h3><p>No ano de 2012, comecei o curso de Tecnólogo em Sistemas para Internet no Centro Universitário Senac. Durante todos os semestres realizei um projeto integrador, que no total eram cinco projetos:<br>Uma Landing Page, um e-commerce, uma API em php, App Android e um Dashboard.<br>O primeiro semestre foi onde aprendi a programar utilizando linguagem algoritmica, tive a primeira introdução ao HTML5, Css e JavaScript. No segundo semestre, aprendi a linguagem C#, e linguagem Java com Orientação a Objetos e como criar um Ecommerce com o framework .NET. Já no terceiro semestre, aprendi a linguagem PHP e tbm tive introdução a segurança da informação. No quarto semestre, aprendi a trabalhar mais com Java criando Servlets e tambem para criar App no Android com a IDE Eclipse. O ultimo semestre foi onde aprendi a trabalhar com o framework Laravel, e também a criar um Dashboard com o framework Angular.</div>"
  },
  "jobs": {
    "title" : "Trabalhos",
    "complete_description" : "<div><div><h2>Experiência profissional</h2><div><h3>fev. de 2013 - jul. de 2013</h3><p>No ano de 2013, iniciei minha carreira como estagiário / programador júnior na VAD - Estúdio Multimídia em São Paulo, Brasil. Neste papel, trabalhei com tecnologias como:<br>JQuery, HTML, CSS e JavaScript.<br><br>- Atuei no desenvolvimento de sites e sistemas web, utilizando as tecnologias citadas acima.<br>- Também realizava a manutenção de sites e sistemas já existentes.<br>- Realizava o desenvolvimento de peças de e-mail marketing.<br>- Realiza desparos de e-mail marketing utilizando a ferramenta PhpMailer.</p></div><div><h3>fev de 2016 - out de 2017</h3><p>Entre fevereiro de 2016 ja havia me formado como Tecnólogo em Sistemas para Internet e atuei na Capital Mídia em São Paulo, Brasil. No cargo de Programador, apos o periodo de experiencia, fui efetivado e depois de um ano fui promovido a Programador Pleno. Durante este período, trabalhei com tecnologias como JQuery, Git, PHP, HTML5, WordPress, CSS e JavaScript.<br><br>- Realizava reuniões com o time de criação para alinhamento de projetos.<br>- Estimava o tempo de desenvolvimento dos projeto junto com o time de criação.<br>- Realizava reuniões com o time de desenvolvimento externo para entrega de projetos.<br>- Atuei na contratação de novos desenvolvedores.<br>- Atuei como líder técnico do time de desenvolvimento, auxiliando os desenvolvedores abaixo e destribuindo trabalhos.<br>- Atuei no desenvolvimento de sites e sistemas web, utilizando as tecnologias citadas acima.<br>- Atuei no desenvolvimento de landing pages e hotsites.<br>- Também realizava a manutenção de sites e sistemas já existentes.<br>- Realizava o desenvolvimento de peças de e-mail marketing.</p></div><div><h3>out de 2017 - fev de 2018</h3><p>No final de 2017 passei a trabalhar home office como freelancer, onde atuei como Desenvolvedor Frontend em parceria com na Agencia WebSide. Durante este período, realizei diversos projetos para a agencia, onde era responsavel pelo desenvolvimento frontend dos projetos.<br>e trabalhei com tecnologias como JQuery, Git, HTML5, CSS.<br><br>- Realizava reuniões com o time de desenvolvimento para alinhamento de projetos.<br>- Atuei no desenvolvimento do frontend de sites e landing pages, utilizando as tecnologias citadas acima.<br>- Atuei no desenvolvimento de peças de e-mail marketing.</p></div><div><h3>fev de 2018 - out de 2018</h3><p>De fevereiro de 2018 a outubro de 2018, fui Desenvolvedor de Front-end na 123Carros, São Paulo, Brasil. Durante este período, era responsavel pelo desenvolvimento frontend do Marketplace.<br>trabalhei com tecnologias como JQuery, Git, Laravel, SASS e PHP.<br><br>- Realizava reuniões com o time de desenvolvimento para alinhamento do projetos.<br>- Atuei no desenvolvimento do frontend da plataforma.<br>- Atuei como líder técnico do time de desenvolvimento frontend, auxiliando os desenvolvedores abaixo e destribuindo trabalhos.<br>- Atuei no desenvolvimento do frontend da plataforma utilizando as tecnologias citadas acima.<br>- Atuei no desenvolvimento de um blog para a plataforma utilizando o WordPress.</p></div><div><h3>nov de 2017 - set de 2018</h3><p>A partir de novembro de 2017, voltei a trabalhar home office como freelancer, onde atuei como Desenvolvedor Frontend em parceria com na Agencia WebSide. onde era responsavel pelo desenvolvimento frontend dos projetos. continuei trabalhando com tecnologias como JQuery, Git, HTML5, CSS.<br><br>- Realizava reuniões com o time de desenvolvimento para alinhamento de projetos.<br>- Estimava o tempo de desenvolvimento dos projeto junto com o time de desenvolvimento.<br>- Atuei no desenvolvimento do frontend de sites e landing pages, utilizando as tecnologias citadas acima.<br>- Atuei no desenvolvimento de peças de e-mail marketing.</p></div><div><h3>set de 2018 - dez de 2018</h3><p>Em setembro de 2018 e até dezembro de 2018, atuei como Desenvolvedor Fullstack na Agência Shape Web, Campo Grande, Mato Grosso do Sul, Brasil. Trabalhei com MySQL, JQuery, Javascript, Git, SASS, PHP e HTML5.<br><br>- Fui aprovado em um teste pratico para desenvolvedor fullstack php.<br>- Realizava reuniões com o time de desenvolvimento para alinhamento de projetos.<br>- Estimava o tempo de desenvolvimento dos projeto junto com o time de desenvolvimento.<br>- Atuei no desenvolvimento fullstack de sites e landing pages e tambem plataforma de ecommerce, utilizando as tecnologias citadas acima.</p></div><div><h3>fev de 2019 - março de 2018</h3><p>No ano de 2019, voltei a morar em São Paulo, e atuei como Desenvolvedor Fullstack na Agência 3xceler, São Paulo, Brasil, onde trabalhei com Stylus, MySQL, JQuery, Git, PHP, HTML5 e WordPress.<br><br>- Fui aprovado em um teste pratico para desenvolvedor fullstack php.<br>- Realizava reuniões com o time de desenvolvimento para alinhamento de projetos.<br>- Atuei no desenvolvimento fullstack de sites de dois sites completos utilizando o cms wordpress.</p></div><div><h3>mar de 2019 - abr de 2020</h3><p>Entre março de 2019 e abril de 2020, atuei como Desenvolvedor de Front-end na Zebra Deluxe Comunicação, São Paulo, Brasil. Durante este período, trabalhei com MySQL, JQuery, Laravel, SASS, WordPress e JavaScript.<br><br>- Fui aprovado em um teste pratico para desenvolvedor fullstack pleno.<br>- Realizava Daily Scrum com o time de desenvolvimento para alinhamento de projetos.<br>- Estimava o tempo de desenvolvimento dos projeto junto com o time de desenvolvimento.<br>- Atuei na contratação de novos desenvolvedores.<br>- Atuei como líder técnico do time de desenvolvimento frontend, auxiliando os desenvolvedores abaixo e destribuindo trabalhos.<br>- Atuei no desenvolvimento de sites e sistemas web, utilizando as tecnologias citadas acima.<br>- Atuei no desenvolvimento de landing pages e hotsites.<br>- Também realizava a manutenção de sites e sistemas já existentes.<br>- Realizava o desenvolvimento de peças de e-mail marketing.</p></div><div><h3>mar de 2020 - dez de 2020</h3><p>Em março de 2020, iniciei meu trabalho na Interaktiv, onde atuei como Desenvolvedor Fullstack.<br>Em junho do mesmo ano a Interaktiv passou por um merger and acquisition pela multinacional brasileira CTC. Trabalhei com tecnologias como Linux, Docker, Git, CakePHP, Laravel, WordPress, Vue.js e JavaScript.<br><br>- Fui aprovado em um teste pratico para desenvolvedor fullstack pleno.<br>- Realizava Daily Scrum com o time de desenvolvimento para alinhamento de projetos.<br>- Realizava Planning do Scrum com o time de desenvolvimento para alinhamento de projetos uma vez por mês.<br>- Realizava o atendimento dos Tickets criados pelos clientes.<br>- Realizava cadastro de todas as horas gastas (em tickets ou demandas internas) realizadas na plataforma da interaktiv.<br>- Atuei no desenvolvimento de sites e sistemas web, utilizando as tecnologias citadas acima.<br>- Também realizava a manutenção de sites e sistemas já existentes.<br></p></div><div><h3>jan de 2021 - fev de 2021</h3><p>Em janeiro de 2022, apos uma indicação, iniciei um trabalho freelancer para o cliente Ferraz e Fonseca Odontologia. Onde atuei em toda a construção do site institucional da empresa utilizando o CMS Wordpress.<br><br>- Realizava reuniões com o cliente para alinhamento de projetos.<br>- Atuei no desenvolvimento do frontend e backend do site utilizando o cms wordpress.<br>- Atuei no desenvolvimento de banners e layout das paginas utilizando o photoshop.<br>- Realizei o versionamentodo site utilizando o git e o github.<br>- Realizei o deploy do site utilizando o cpanel.<br></p></div><div><h3>mar de 2021 - jun de 2021</h3><p>Em Março de 2022, apos uma outra indicação, iniciei um trabalho freelancer para a CBC Agronegócios. durante esse periodo atuei em diversos ajustes no site institucional da empresa com o CMS Wordpress.<br><br>- Realizava reuniões com o cliente para alinhamento de projetos.<br>- Atuei no desenvolvimento do frontend e backend do site de algumas partes do site<br>- Atuei na melhoria de performance e otimização do projeto<br>- Desenvolvi novas paginas e fiz a manutenção em paginas antigas<br>- Realizei a configuração do plugin de SEO do site e certificado SSL<br>- Realizei diversas atualizaçoes no tema legado do site</p></div><div><h3>ago de 2021 - nov de 2021</h3><p>Em Agosto de 2022, apos uma outra indicação, iniciei um novo trabalho freelancer para a Agencia LayerUp. durante esse periodo atuei em dois projetos da empresa com o CMS Wordpress.<br><br>- Realizava reuniões com o cliente para alinhamento de projetos.<br>- Utilizava o Git para versionamento do projeto.<br>- Atuei no desenvolvimento do frontend e backend completo de uma landing page. (geradev)<br>- Atuei no desenvolvimento do frontend e backend completo de um blog. (playcenter)<br>- Atuei no deploy dos projetos utilizando o cpanel.<br></p></div><div><h3>fev de 2022 - mar de 2022</h3><p>Comecei o ano de 2022 trabalhando na Meeta Solutions, onde fui contratado como PJ em modelo hibrido no cargo de Desenvolvedor de Fullstack. Durante esse periodo fiquei alocado dentro de um projeto da FIS Global residindo na sede da FIS em Jundíai, São Paulo. No periodo de experiencia utilizei tecnologias como Windows, Docker, JQuery, Laravel, Blade Templates, CSS e Git.<br><br>- Fui aprovado em um teste pratico para desenvolvedor fullstack pleno.<br>- Realizei uma parte do treinamento do RP, por video chamada, com o PM do projeto que estava alocado<br>- Realizava demandas pontuais de desenvolvimento de sites e sistemas web.<br>- Realizava cadastro de todas as tarefas realizadas na plataforma runrun.it.<br></p></div><div><h3>mar de 2022 - abr de 2022</h3><p>Tomei a decisão em março em mudar de emprego e comecei a procurar novas oportunidades, fui contratado como PJ em modelo home office no cargo de Desenvolvedor de Frontend na QuikDev com a sede localizada em Campinas, São Paulo. Durante esse periodo trabalhei com tecnologias como Typescript, Nextjs, React, TailwindCSS, Git e Docker.<br><br>- Fui aprovado em um teste pratico para desenvolvedor frontend pleno.<br>- Realizei a Planning do Scrum com o time de desenvolvimento para alinhamento do projeto<br>- Realizava Daily Scrum com o time de desenvolvimento para alinhamento de projetos.<br>- Desenvolvi paginas com react utilizando o NextJS como framework frontend.<br></p></div><div><h3>mai de 2022 - jun de 2022</h3><p>Em maio de 2022, fiz novos freelancers para a Agencia LayerUp. atuando diretamente no site da empresa, e em outro projeto, que era para um cliente da agencia, a brspice. Durante esse periodo trabalhei com tecnologias como Php, Wordpress, SCSS, WEBPACK, Jquery e Javascript.<br><br>- Realizava reuniões com o cliente para alinhamento de projetos.<br>- Utilizava o Git para versionamento do projeto.<br>- Atuei na integração ao Webpack e otimização de SEO - Atuei na reformulação do frontend na melhoria do codigo e performance.<br>- Atuei em novas features (frontend &amp; backend).<br></p></div><div><h3>jul de 2022 - ago de 2022</h3><p>Em jul de 2022, a Agencia Zebra Deluxe me chamou para um novo projeto. realizei o desenvolvimento de um site institucional para um cliente da agencia o projeto foi feito com wordpress e o frontend utilizava webpack com javascript e sass.<br><br>- Realizava reuniões com o cliente para alinhamento de projetos.<br>- Utilizava o Git para versionamento do projeto.<br>- Atuei no desenvolvimento do frontend e backend do site utilizando o cms wordpress.<br>- Realizei o deploy do site utilizando o cpanel.<br>- Realizei a configuração do plugin de SEO do site e certificado SSL<br></p></div><div><h3>set de 2022 - dez de 2023</h3><p>Em jul de 2022, a Agencia Zebra Deluxe me chamou para um novo projeto.<br>realizei o desenvolvimento de um site institucional para a agencia em wordpress.<br>alem disso realizei tbm a manutenção de um blog de um cliente da agencia. (skincare club)<br><br>- Realizava reuniões com o cliente para alinhamento de projetos.<br>- Utilizava o Git para versionamento do projeto.<br>- Atuei no desenvolvimento do frontend e backend do site utilizando o cms wordpress.<br>- Realizei o deploy do site utilizando o cpanel.<br>- Realizei a configuração do plugin de SEO do site e certificado SSL<br></p></div><div><h3>dez de 2022 - mar de 2023</h3><p>Em dezembro de 2022, A CBC Agronegócios me chamou para um novo projeto.<br>realizei o desenvolvimento de um novo site institucional para a empresa em wordpress.<br>a empresa estava passando por uma reformulação de marca e o site mudaria o dominio.<br><br>- Realizava reuniões com o cliente para alinhamento de projetos.<br>- Utilizava o Git para versionamento do projeto.<br>- Atuei no desenvolvimento do frontend e backend do site utilizando o cms wordpress.<br>- Realizei o deploy do site utilizando o cpanel.<br>- Realizei a configuração do plugin de SEO do site e certificado SSL<br></p></div><div><h3>jun de 2023 - jul de 2023</h3><p>Em junho de 2023, a Agencia LayerUp me chamou para um novo projeto.<br>realizei o desenvolvimento de um novo site institucional para um cliente da empresa. (atlaseletro)<br><br>- Realizava reuniões com o cliente para alinhamento de projetos.<br>- Utilizava o Git para versionamento do projeto.<br>- Atuei no desenvolvimento do frontend e backend do site utilizando o cms wordpress.<br>- Realizei a configuração e implementação do Webpack no frontend do site.<br></p></div><div><h3>ago de 2023 - set de 2023</h3><p>Em agosto de 2023, a Agencia Zebra Deluxe me chamou para um novo projeto.<br>realizei o desenvolvimento de um novo site institucional para um cliente da empresa. (mobu.business)<br><br>- Realizava reuniões com o cliente para alinhamento de projetos.<br>- Utilizava o Git para versionamento do projeto.<br>- Atuei no desenvolvimento do frontend e backend do site utilizando o cms wordpress.<br>- Realizei a configuração e implementação do Webpack no frontend do site.<br>- Realizei o deploy do site utilizando o cpanel.<br>- Realizei a configuração do plugin de SEO do site e certificado SSL<br></p></div><div><h3>out de 2023 - dez de 2023</h3><p>No periodo de outubro de 2023 a dezembro de 2023, voltei a estudar e me especializar em tecnologias como Node e Typescript. Durante esse periodo, realizei estudo com Node utilizando o framework Express e com Typescript utilizando o framework NestJS e Angular. Todos os projetos foram publicados no meu github e disponibilizados para a comunidade.</p></div><div><h3>jan de 2024 - abr de 2024</h3><p>Em janeiro de 2024, fui contratado como PJ em modelo presencial no cargo de Desenvolvedor de Fullstack na KeepCloud com a sede localizada em São Paulo, Brasil. Durante esse periodo trabalhei com tecnologias como Php, Laravel, Git, Docker, Redis, Bootstrap e MySQL.<br><br>- Fui aprovado em um teste pratico para desenvolvedor fullstack pleno.<br>- Realizava Daily Scrum com o time de desenvolvimento para alinhamento de projetos.<br>- Realizava Planning do Scrum com o time de desenvolvimento para alinhamento de projetos uma vez por mês.<br>- Atuei no desenvolvimento fullstack da plataforma, utilizando as tecnologias citadas acima.<br>- Atuei na integração com a API de diversos servidores cloud com a plataforma.<br>- Atuei na integração com a API de serviços da plataforma.<br>- Atuei na integração de serviços instalados diretamente nos servidores cloud.</p></div></div></div>"
  }
}
